In [5]:
# Task: Excel File Manipulation
# Objective: Read an Excel file, process the data, and write the results to a new Excel file.
# Instructions:
# You are provided with an Excel file named students.xlsx containing the following columns:
# Name
# Math
# Science
# English
# Write a Python program that:
# a. Reads the Excel file into a DataFrame (or using openpyxl if preferred).
# b. Calculates the Total and Average marks for each student.
# c. Adds these as new columns in the DataFrame or Excel sheet.
# d. Identifies students who scored average >= 60 as "Passed" and < 60 as "Failed". Add a column Result for this.
# e. Writes the updated data to a new Excel file students_result.xlsx.

In [6]:
import pandas as pd

# read excel file into a dataframe
df=pd.read_excel("students.xlsx")
print("Original data:")
print(df)

Original data:
    Name  Math  Science  English
0    Ram    70       60       80
1   Hari    50       55       45
2  Shyam    85       80       75
3   Sita    60       65       70
4   Gita    90       95       85

In [ ]:
# calculate total and average marks for each student and add them as new columns

df['Total'] = df['Math'] + df['Science'] + df['English']
df['Average'] = df['Total'] / 3

In [8]:
df

    Name  Math  Science  English  Total  Average
0    Ram    70       60       80    210     70.0
1   Hari    50       55       45    150     50.0
2  Shyam    85       80       75    240     80.0
3   Sita    60       65       70    195     65.0
4   Gita    90       95       85    270     90.0

In [9]:
# if average > 60 then passs, else fail

df['Result'] = df['Average'].apply(lambda x: 'Passed' if x >= 60 else 'Failed')

In [10]:
df

    Name  Math  Science  English  Total  Average  Result
0    Ram    70       60       80    210     70.0  Passed
1   Hari    50       55       45    150     50.0  Failed
2  Shyam    85       80       75    240     80.0  Passed
3   Sita    60       65       70    195     65.0  Passed
4   Gita    90       95       85    270     90.0  Passed

In [11]:
# write the updated data into new excel file

df.to_excel("students_result.xlsx", index=False)

print("Data Updated and Saved into new excel file")

Data Updated and Saved into new excel file